MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32HG222F64/mcu.h
/** Flash and SRAM limits for EFM32HG222F64 */
#define FLASH_BASE           (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE           (0x00010000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE      1024U          /**< Flash Memory page size */
#define SRAM_BASE            (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE            (0x00002000UL) /**< Available SRAM Memory */
#define __CM0PLUS_REV        0x0001U        /**< Cortex-M0+ Core revision r0p1 */
#define PRS_CHAN_COUNT       6              /**< Number of PRS channels */
#define DMA_CHAN_COUNT       6              /**< Number of DMA channels */
#define EXT_IRQ_COUNT        21             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX           42U
#define AFCHANLOC_MAX        7U
/** Analog AF channels */
#define AFACHAN_MAX          27U

/* Part number capabilities */

#define TIMER_PRESENT           /**< TIMER is available in this part */
#define TIMER_COUNT           3 /**< 3 TIMERs available  */
#define ACMP_PRESENT            /**< ACMP is available in this part */
#define ACMP_COUNT            1 /**< 1 ACMPs available  */
#define USART_PRESENT           /**< USART is available in this part */
#define USART_COUNT           2 /**< 2 USARTs available  */
#define IDAC_PRESENT            /**< IDAC is available in this part */
#define IDAC_COUNT            1 /**< 1 IDACs available  */
#define ADC_PRESENT             /**< ADC is available in this part */
#define ADC_COUNT             1 /**< 1 ADCs available  */
#define LEUART_PRESENT          /**< LEUART is available in this part */
#define LEUART_COUNT          1 /**< 1 LEUARTs available  */
#define PCNT_PRESENT            /**< PCNT is available in this part */
#define PCNT_COUNT            1 /**< 1 PCNTs available  */
#define I2C_PRESENT             /**< I2C is available in this part */
#define I2C_COUNT             1 /**< 1 I2Cs available  */
#define AES_PRESENT             /**< AES is available in this part */
#define AES_COUNT             1 /**< 1 AES available */
#define DMA_PRESENT             /**< DMA is available in this part */
#define DMA_COUNT             1 /**< 1 DMA available */
#define LE_PRESENT              /**< LE is available in this part */
#define LE_COUNT              1 /**< 1 LE available */
#define USBLE_PRESENT           /**< USBLE is available in this part */
#define USBLE_COUNT           1 /**< 1 USBLE available */
#define MSC_PRESENT             /**< MSC is available in this part */
#define MSC_COUNT             1 /**< 1 MSC available */
#define EMU_PRESENT             /**< EMU is available in this part */
#define EMU_COUNT             1 /**< 1 EMU available */
#define RMU_PRESENT             /**< RMU is available in this part */
#define RMU_COUNT             1 /**< 1 RMU available */
#define CMU_PRESENT             /**< CMU is available in this part */
#define CMU_COUNT             1 /**< 1 CMU available */
#define PRS_PRESENT             /**< PRS is available in this part */
#define PRS_COUNT             1 /**< 1 PRS available */
#define GPIO_PRESENT            /**< GPIO is available in this part */
#define GPIO_COUNT            1 /**< 1 GPIO available */
#define VCMP_PRESENT            /**< VCMP is available in this part */
#define VCMP_COUNT            1 /**< 1 VCMP available */
#define RTC_PRESENT             /**< RTC is available in this part */
#define RTC_COUNT             1 /**< 1 RTC available */
#define HFXTAL_PRESENT          /**< HFXTAL is available in this part */
#define HFXTAL_COUNT          1 /**< 1 HFXTAL available */
#define LFXTAL_PRESENT          /**< LFXTAL is available in this part */
#define LFXTAL_COUNT          1 /**< 1 LFXTAL available */
#define USHFRCO_PRESENT         /**< USHFRCO is available in this part */
#define USHFRCO_COUNT         1 /**< 1 USHFRCO available */
#define WDOG_PRESENT            /**< WDOG is available in this part */
#define WDOG_COUNT            1 /**< 1 WDOG available */
#define DBG_PRESENT             /**< DBG is available in this part */
#define DBG_COUNT             1 /**< 1 DBG available */
#define MTB_PRESENT             /**< MTB is available in this part */
#define MTB_COUNT             1 /**< 1 MTB available */
#define BOOTLOADER_PRESENT      /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT      1 /**< 1 BOOTLOADER available */
#define ANALOG_PRESENT          /**< ANALOG is available in this part */
#define ANALOG_COUNT          1 /**< 1 ANALOG available */

/** @} End of group EFM32HG222F64_Part */

#define ARM_MATH_CM0PLUS
// #include "core_cm0plus.h" /* Cortex-M0+ processor and core peripherals */  // Note: Changed for MikroE implementation.
// #include "system_efm32hg.h" /* System Header */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/***************************************************************************//**
 * @defgroup EFM32HG222F64_Peripheral_TypeDefs EFM32HG222F64 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32hg_aes.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_rmu.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32HG222F64_CMU EFM32HG222F64 CMU
 * @{
 * @brief EFM32HG222F64_CMU Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t CTRL;           /**< CMU Control Register  */
  __IOM uint32_t HFCORECLKDIV;   /**< High Frequency Core Clock Division Register  */
  __IOM uint32_t HFPERCLKDIV;    /**< High Frequency Peripheral Clock Division Register  */
  __IOM uint32_t HFRCOCTRL;      /**< HFRCO Control Register  */
  __IOM uint32_t LFRCOCTRL;      /**< LFRCO Control Register  */
  __IOM uint32_t AUXHFRCOCTRL;   /**< AUXHFRCO Control Register  */
  __IOM uint32_t CALCTRL;        /**< Calibration Control Register  */
  __IOM uint32_t CALCNT;         /**< Calibration Counter Register  */
  __IOM uint32_t OSCENCMD;       /**< Oscillator Enable/Disable Command Register  */
  __IOM uint32_t CMD;            /**< Command Register  */
  __IOM uint32_t LFCLKSEL;       /**< Low Frequency Clock Select Register  */
  __IM uint32_t  STATUS;         /**< Status Register  */
  __IM uint32_t  IF;             /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;            /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;            /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;            /**< Interrupt Enable Register  */
  __IOM uint32_t HFCORECLKEN0;   /**< High Frequency Core Clock Enable Register 0  */
  __IOM uint32_t HFPERCLKEN0;    /**< High Frequency Peripheral Clock Enable Register 0  */
  uint32_t       RESERVED0[2U];  /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;       /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;         /**< Freeze Register  */
  __IOM uint32_t LFACLKEN0;      /**< Low Frequency A Clock Enable Register 0  (Async Reg)  */
  uint32_t       RESERVED1[1U];  /**< Reserved for future use **/
  __IOM uint32_t LFBCLKEN0;      /**< Low Frequency B Clock Enable Register 0 (Async Reg)  */
  __IOM uint32_t LFCCLKEN0;      /**< Low Frequency C Clock Enable Register 0 (Async Reg)  */
  __IOM uint32_t LFAPRESC0;      /**< Low Frequency A Prescaler Register 0 (Async Reg)  */
  uint32_t       RESERVED2[1U];  /**< Reserved for future use **/
  __IOM uint32_t LFBPRESC0;      /**< Low Frequency B Prescaler Register 0  (Async Reg)  */
  uint32_t       RESERVED3[1U];  /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;       /**< PCNT Control Register  */

  uint32_t       RESERVED4[1U];  /**< Reserved for future use **/
  __IOM uint32_t ROUTE;          /**< I/O Routing Register  */
  __IOM uint32_t LOCK;           /**< Configuration Lock Register  */

  uint32_t       RESERVED5[18U]; /**< Reserved for future use **/
  __IOM uint32_t USBCRCTRL;      /**< USB Clock Recovery Control  */
  __IOM uint32_t USHFRCOCTRL;    /**< USHFRCO Control  */
  __IOM uint32_t USHFRCOTUNE;    /**< USHFRCO Frequency Tune  */
  __IOM uint32_t USHFRCOCONF;    /**< USHFRCO Configuration  */
} CMU_TypeDef;                   /**< CMU Register Declaration *//** @} */

// #include "efm32hg_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32HG222F64_PRS EFM32HG222F64 PRS
 * @{
 * @brief EFM32HG222F64_PRS Register Declaration
 ******************************************************************************/
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTE;         /**< I/O Routing Register  */

  uint32_t       RESERVED0[1U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[6U];        /**< Channel registers */

  uint32_t       RESERVED1[6U]; /**< Reserved for future use **/
  __IOM uint32_t TRACECTRL;     /**< MTB Trace Control Register  */
} PRS_TypeDef;                  /**< PRS Register Declaration *//** @} */

// #include "efm32hg_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_vcmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_mtb.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_romtable.h"  // Note: Changed for MikroE implementation.
// #include "efm32hg_calibrate.h"  // Note: Changed for MikroE implementation.

/** @} End of group EFM32HG222F64_Peripheral_TypeDefs */

/***************************************************************************//**
 * @defgroup EFM32HG222F64_Peripheral_Base EFM32HG222F64 Peripheral Memory Map
 * @{
 ******************************************************************************/

#define AES_BASE          (0x400E0000UL) /**< AES base address  */
#define DMA_BASE          (0x400C2000UL) /**< DMA base address  */
#define MSC_BASE          (0x400C0000UL) /**< MSC base address  */
#define EMU_BASE          (0x400C6000UL) /**< EMU base address  */
#define RMU_BASE          (0x400CA000UL) /**< RMU base address  */
#define CMU_BASE          (0x400C8000UL) /**< CMU base address  */
#define TIMER0_BASE       (0x40010000UL) /**< TIMER0 base address  */
#define TIMER1_BASE       (0x40010400UL) /**< TIMER1 base address  */
#define TIMER2_BASE       (0x40010800UL) /**< TIMER2 base address  */
#define ACMP0_BASE        (0x40001000UL) /**< ACMP0 base address  */
#define USART0_BASE       (0x4000C000UL) /**< USART0 base address  */
#define USART1_BASE       (0x4000C400UL) /**< USART1 base address  */
#define PRS_BASE          (0x400CC000UL) /**< PRS base address  */
#define IDAC0_BASE        (0x40004000UL) /**< IDAC0 base address  */
#define GPIO_BASE         (0x40006000UL) /**< GPIO base address  */
#define VCMP_BASE         (0x40000000UL) /**< VCMP base address  */
#define ADC0_BASE         (0x40002000UL) /**< ADC0 base address  */
#define LEUART0_BASE      (0x40084000UL) /**< LEUART0 base address  */
#define PCNT0_BASE        (0x40086000UL) /**< PCNT0 base address  */
#define I2C0_BASE         (0x4000A000UL) /**< I2C0 base address  */
#define RTC_BASE          (0x40080000UL) /**< RTC base address  */
#define WDOG_BASE         (0x40088000UL) /**< WDOG base address  */
#define MTB_BASE          (0xF0040000UL) /**< MTB base address  */
#define CALIBRATE_BASE    (0x0FE08000UL) /**< CALIBRATE base address */
#define DEVINFO_BASE      (0x0FE081B0UL) /**< DEVINFO base address */
#define ROMTABLE_BASE     (0xF00FFFD0UL) /**< ROMTABLE base address */
#define LOCKBITS_BASE     (0x0FE04000UL) /**< Lock-bits page base address */
#define USERDATA_BASE     (0x0FE00000UL) /**< User data page base address */

